{"title":"Tuise Lesson two - How to install dependencies on my RPi","content":"In order to get **Tuise** up and running, we'll be installing a set of apps and components on our RPi, so it has the ability to run independent.\nSince we want to prepare well, we're going to focus on the dependencies first, like we'd go grocery shopping before we cook.\n\n####The Raspbian OS.\nIn [Tuise Lesson one - How to clean install my RPi.](http://tuihackfridays.com/#article/12), we flashed a Micro SD with the Raspbian OS.\nIn case you've done this a while ago, or work with the legacy SD card, make sure you update. Make sure your wifi is enabled (right hand side menu icon).\n\nOpen your CLI terminal and run the follwing 2 commands:\n\n```sudo apt-get update```\n\n```sudo apt-get dist-upgrade```\n\n## Server\nWe'll be running the eventual Tuise app on a local server. Easy enough, our interfacing is built on React and Redux, which offers most of this through Webpack, which is all we need for a POC.\n\nRaspbian includes an outdated version of Node, so we'll manually load a apt package first.\n\n```curl -sL https://deb.nodesource.com/setup_7.x | sudo -E bash -```\n\nNow we're ready to install the dependencies:\n\n```sudo apt-get install nodejs npm```\n\n```npm install react redux```\n\n\n## Browser\nTo visualise the interface, we'll be using a browser in Kiosk mode. The perfect excuse to dust of some old Firefox love.\nFirefox on Raspbian will do the trick, but you're of course free to pull this off with Chromium as well.\n\n#### Firefox\nFirst install the iceweasel (Firefox on Raspbian):\n\n```sudo apt-get install iceweasel --no-install-recommends```\n\nThe `--no-install-recommends` keeps the clutter away.\n\n#### Kiosk mode\nTo enable Kiosk mode, we only have to download a **Firefox add-on** to help us out. We'll enable it in a later phase, but let's get it ready straight away.\n\n* Go to the Raspbian menu, navigate to Internet, and click **Firefox ESR**\n* In Firefox, open the menu on the right-hand side and click the Add-ons icon\n* Search for \"RKiosk\", the add-on we'll be using today\n* Click install, and leave it there for a bit\n\nWe'll get back to Firefox in a bit.\n\n\n","category":"Hackfridays","hidden":false}