{"title":"Tuise Lesson three - Installing and running Tuise","content":"**Tuise** needs a vsiual interface, in this post we'll be installing exactly that.\n\n#### Preface\nBeing all fancy, like we are, the interface will be based on React. However, it is important to note that we don't use the [2pack-list repo](https://github.com/Cloudoki/2pack-list) from the [Mobile React Native](http://tuihackfridays.com/#article/10) for this. \nThe reason is simple, React Native is wonderful for Android/iOS, but quite useless for a web browser.\n\n_Make sure you installed the dependencies for your RPi as described in [Tuise Lesson two - How to install dependencies on my RPi]http://tuihackfridays.com/#article/13)._\n\n\n## Step 1\n\nIn order to start with a good base, we'll use our own React Boilerplate.\n\n### React/Redux Donderstarter\nThis boilerplate is designed to get you up and running with React/Router/Redux/Sagas workflow, backed up by webpack and unit testing with jest/enzyme.\nThe primary goal of this boilerplate is to provide a stable foundation upon which to build modern web applications.\n\n#### Option a: from scratch\nFor reference, these are the steps we took to build the tuise interface, feel free to experiment with this process yourself. For the below process to work, first [create a new repo](https://help.github.com/articles/creating-a-new-repository/) in Github.\nHowever, skip this step if you only want to the end result.\n\n```git clone --bare https://github.com/Cloudoki/react-redux-donderstarter.git boilerplate```\n\n```cd boilerplate```\n\n```git push --mirror https://github.com/TUIHackfridays/tuise-poc.git```\n\n\n\n#### Option b: clone _(choose this one)_\nOf course, it has limited use to all work on different repositories, that's why you can simply collect the one we've pre-built:\n\n``` cd ~/ ``` (or your preferred working directory)\n\n```git clone https://github.com/TUIHackfridays/tuise-poc.git tuise-poc```\n\n```cd tuise-poc```\n\n```npm install```\n\n```npm run dev```\n\nHot reloading is enabled by default for both **JavaScript** and **SCSS** files.\n\nYou'll see that we've added some entries to the `tuise-poc` reository.\n\n\nWe're currently actively building the repo for **Step 1**, hold on.","category":"Hackfridays","hidden":false}